Repository: atilimkoca/GlucoWizard-flutter
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Tracking Page
tr: Takip Çizelgesi

source: Training Guide
tr: Eğitim Kılavuzu

# type1_prediction
source: Type 1 Blood Sugar Prediction
tr: Tip 1 Kan Şekeri Tahmini

# type2_prediction
source: Type 2 Blood Sugar Prediction
tr: Tip 2 Kan Şekeri Tahmini

# profile_page
source: Profile
tr: Profil

# diagnose
source: Diabetes Diagnosis
tr: Diyabet Teşhisi

# alarm_page
source: Alarms
tr: Alarmlar

# glucose_measurement
source: Blood Sugar Measurement
tr: Kan Şekeri Ölçümü

# insulin
source: Insulin Application
tr: İnsülin Uygulaması

source: Foot Care
tr: Ayak Bakımı

source: Nutrition
tr: Beslenme

source: Exercise
tr: Egzersiz

source: Hypoglycemia
tr: Hipoglisemi

source: Hyperglycemia
tr: Hiperglisemi

# oral_drugs
source: Oral Antidiabetic Drugs
tr: Oral Antidiyabetik İlaçlar

# fifteenMinText
source: Please enter your blood glucose values for the past 10 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 10 dakikalık kan şekeri değerlerinizi giriniz

# thirtyMinText
source: Please enter your blood glucose values for the past 25 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 25 dakikalık kan şekeri değerlerinizi giriniz

# fortyFiveMinText
source: Please enter your blood glucose values for the past 40 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 40 dakikalık kan şekeri değerlerinizi giriniz

# sixtyminText
source: Please enter your blood glucose values for the past 55 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 50 dakikalık kan şekeri değerlerinizi giriniz

# ninetyminText
source: Please enter your blood glucose values for the past 85 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 85 dakikalık kan şekeri değerlerinizi giriniz

# oneTwentyminText
source: Please enter your blood glucose values for the past 115 minutes at 5 minute intervals
tr: Lütfen 5'er dakika aralıklarla geçmiş 115 dakikalık kan şekeri değerlerinizi giriniz

# fifteenMinText2
source: Please enter your blood glucose values for the past 15 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 10 dakikalık kan şekeri değerlerinizi giriniz

# thirtyMinText2
source: Please enter your blood glucose values for the past 15 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 15 dakikalık kan şekeri değerlerinizi giriniz

# fortyFiveMinText2
source: Please enter your blood glucose values for the past 30 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 30 dakikalık kan şekeri değerlerinizi giriniz

# sixtyminText2
source: Please enter your blood glucose values for the past 45 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 45 dakikalık kan şekeri değerlerinizi giriniz

# ninetyminText2
source: Please enter your blood glucose values for the past 75 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 75 dakikalık kan şekeri değerlerinizi giriniz

# oneTwentyminText2
source: Please enter your blood glucose values for the past 105 minutes at 15 minute intervals
tr: Lütfen 15'er dakika aralıklarla geçmiş 105 dakikalık kan şekeri değerlerinizi giriniz

# fiveMin
source: 15 Minute
tr: 15 Dakika

# thirtyMin
source: 30 Minute
tr: 30 Dakika

# fourtyMin
source: 45 Minute
tr: 45 Dakika

# sixtyMin
source: 60 Minute
tr: 60 Dakika

# ninetyMin
source: 90 Minute
tr: 90 Dakika

# houndredMin
source: 120 Minute
tr: 120 Dakika

source: Select Time
tr: Zaman Seçiniz

# prediction
source: Predict
tr: Tahmin Et

# enterGlucoseValue
source: Enter your glucose value
tr: Glikoz değerinizi giriniz

# risk_hypo
source: There is a Risk of Hypoglycemia !
tr: Hipoglisemi Riski Var !

# normal_value
source: Your Blood Sugar Value Will be Normal.
tr: Kan Şekeri Değeriniz Normal Sınırlar İçinde Olacaktır.

# hidden_sugar
source: There is a Risk of Pre-Diabetes!
tr: Gizli Şeker Riski Var!

# risk_hyper
source: There is a Risk of Hyperglycemia !
tr: Hiperglisemi Riski Var !

# fifteen_min_later
source: After 15 Minutes
tr: 15 Dakika Sonra

# thirty_min_later
source: After 30 Minutes
tr: 30 Dakika Sonra

# fourty_five_min_later
source: After 45 Minutes
tr: 45 Dakika Sonra

# sixty_min_later
source: After 60 Minutes
tr: 60 Dakika Sonra

# ninety_min_later
source: After 90 Minutes
tr: 90 Dakika Sonra

# one_twenty_min_later
source: After 120 Minutes
tr: 120 Dakika Sonra

# okay
source: Ok
tr: Tamam

# enter_insulin_value
source: Enter your insulin value
tr: İnsülin değerinizi giriniz

# diagnose_text
source: Please enter your blood glucose level and insulin dose for diabetes diagnosis
tr: Lütfen diyabet teşhisi için kan şekeri seviyenizi ve insülin dozunuzu giriniz

source: Password
tr: Şifre

source: Forgot Password?
tr: Şifrenizi mi Unuttunuz?

source: Login
tr: Giriş Yap

source: Register
tr: Kayıt Ol

# recoverPasswordDescription
source: You can reset your password with the link sent to your e-mail account.
tr: Şifrenizi, e-posta hesabına gönderilen link ile sıfırlayabilirsiniz

# recoverPasswordIntro
source: Please enter your email to reset your password.
tr: Şifrenizi sıfırlamak için lütfen e-postanızı giriniz

# resetPassword
source: Reset Passowrd
tr: Şifremi Sıfırla

# back
source: Turn Back
tr: Geri Dön

# empty_email
source: Email Cannot Be Left Blank
tr: Email Boş Bırakılamaz

# empty_password
source: Password Cannot Be Left Blank
tr: Şifre Boş Bırakılamaz

# password_match
source: Passwords do not match
tr: Şifreler Eşleşmiyor

source: Confirm Password
tr: Şifreyi Onayla

# recoverPasswordSuccess
source: Reset mail sent
tr: Sıfırlama E-postası Gönderildi

# short_password
source: Password must be a minimum of 6 characters.
tr: Şifre Minimum 6 Karakterden Oluşmalıdır

source: Invalid Email
tr: Geçersiz E-posta

# register_error
source: The email is already exist
tr: Girdiğiniz e-posta ile kayıtlı hesap bulunmaktadır

# register_success
source: Registration successful, please verify your e-mail
tr: Kayıt başarılı lütfen e-postanızı doğrulayınız

# login_error
source: The email or password you entered is incorrect.
tr: Girdiğiniz e-posta veya şifre hatalıdır

# email_not_verified
source: Please activate your mail
tr: Lütfen e-postanızı aktifleştiriniz

# recoverPasswordFailed
source: There is no account registered with the e-mail you entered
tr: Girdiğiniz e-posta ile kayıtlı hesap bulunmamaktadır

# permission_requiered
source: Permission Required
tr: İzin Gerekli

# physical_activity_required
source: This app requires access to physical activity data.
tr: Bu uygulama, fiziksel aktivite verilerine erişim gerektirir.

source: Cancel
tr: İptal

# notification_required
source: This app requires access to notification.
tr: Bu uygulama, bildirime erişim gerektirir.

# internet_error
source: Please check your internet connection
tr: Lütfen internet bağlantınızı kontrol ediniz

source: Error
tr: Hata

source: Successful
tr: Başarılı

# recover_description
source: We will send your plain-text password to this email account.
tr: Şifrenizi e-postanıza gönderilecek link ile sıfırlayabilirsiniz.

source: or login with
tr: veya çevrimdışı giriş yapınız

# offline_login
source: Offline
tr: Çevrimdışı

source: Email
tr: E-posta

# tracking_hypo
source: You are at risk of hypoglycemia, you should seek medical support.
tr: Hipoglisemi riskiniz var, tıbbi destek almalısınız.

# tracking_hyper
source: You are at risk of hyperglycemia, you should seek medical support.
tr: Hiperglisemi riskiniz var, tıbbi destek almalısınız.

# tracking_normal
source: Your blood glucose levels are within normal limits.
tr: Kan şekeri değerleriniz normal sınırların içindedir.

# tracking_hidden
source: Your blood sugar is above normal limits, take precautions.
tr: Kan şekeriniz normal sınırların üzerindedir, önlem alınız.

# new_record
source: New Glucose Record
tr: Yeni Glikoz Kaydı

source: Current Time
tr: Şu anki Zaman

# update_glucose
source: Update Glucose Record
tr: Glikoz Değerini Güncelle

# diagnose_healthy
source: No Diabetes Detected
tr: Diyabet Tespit Edilmedi

# diagnose_detected
source: Diabetes Detected
tr: Diyabet Tespit Edildi

# diagnose_hidden
source: Pre-Diabetes Detected
tr: Gizli Şeker Tespit Edildi

# type1
source: You May Have Type 1 Diabetes.
tr: Tip 1 Diyabetli Olabilirsiniz.

# type2
source: You May Have Type 2 Diabetes.
tr: Tip 2 Diyabetli Olabilirsiniz.

# type1_hidden
source: You May Have Pre-Diabetes.
tr: Gizli Şekeriniz Olabilir.

# healthy_text
source: You Look Healthy.
tr: Sağlıklı Görünüyorsunuz.

source: Add Alarm
tr: Alarm Ekle

source: Add Reminder
tr: Hatırlatıcı Ekle

source: Repeat
tr: Tekrar

source: Alarm Name
tr: Alarm Adı

source: Save
tr: Kaydet

# alarm_error
source: Alarm name cannot be left blank
tr: Alarm Adı Boş Bırakılamaz

# personal_info
source: Personal Information
tr: Kişisel Bilgiler

source: Name
tr: İsim

source: Surname
tr: Soyisim

source: Age
tr: Yaş

source: Gender
tr: Cinsiyet

source: Height
tr: Boy

source: Weight
tr: Kilo

# water
source: Daily water consumption amount
tr: Günlük su tüketim miktarı

# step_taken
source: Daily step taken amount
tr: Günlük adım sayısı

# step_not_avaliable
source: Step count is not available
tr: Adım sayısı verisi bulunamadı

source: Pedestrian status
tr: Yürüyüş durumu

# pedestrian_status_not_avaliable
source: Pedestrian status is not available
tr: Yürüyüş durumu verisi bulunamadı

source: Walking
tr: Yürüyüş

source: Stopped
tr: Durdu

source: Male
tr: Erkek

source: Female
tr: Kadın
